Tekla Open API Reference for Tekla Structures 2025
IAssemblable Interface
 The IAssemblable interface dictates which model objects are capabable of belonging to an assembly at the leaf level.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IAssemblable
Public Interface IAssemblable
The IAssemblable type exposes the following members.
Methods
Name | Description
GetAssembly
 Returns the assembly that the assemblable belongs to.
Top
See Also
Reference
Tekla.Structures.Model Namespace